Revit 2027 API
BuiltInFailures.DPartFailures.ElementsAlreadyHaveParts Property
 Some elements already have parts
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ElementsAlreadyHaveParts { get; }
Public Shared ReadOnly Property ElementsAlreadyHaveParts As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ElementsAlreadyHaveParts {
	FailureDefinitionId^ get ();
}
static member ElementsAlreadyHaveParts : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DPartFailures Class
Autodesk.Revit.DB Namespace